lang/CSharp/Examples/XmlApplication1/ConsoleApplication5/Request-xml.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Body>
      <Execute xmlns="http://Dayforce/Services/CoreService">
         <b xmlns:d4p1="http://Dayforce/Data/CoreService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
            <d4p1:SessionTicket>qapayroll5:3ceb6f8b-157a-47f7-9890-23a310083486</d4p1:SessionTicket>
            <d4p1:Infos>
               <d4p1:CoreServiceRequestInfo>
                  <d4p1:RequestName>Get</d4p1:RequestName>
               </d4p1:CoreServiceRequestInfo>
            </d4p1:Infos>
            <d4p1:Payloads xmlns:d5p1="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
               <d5p1:base64Binary>
                  <GeneralGetRequest xmlns="http://SharpTop.Net/Services/Platform">
                     <MethodName>GetAllPayGroupBusinessDayInfo</MethodName>
                     <SessionTicket>qapayroll5:3ceb6f8b-157a-47f7-9890-23a310083486</SessionTicket>
                  </GeneralGetRequest>
               </d5p1:base64Binary>
            </d4p1:Payloads>
         </b>
      </Execute>
   </s:Body>
</s:Envelope>